N = input()
num = int(N)

l = len(N)
N = list(N)

answer = [0] * 10
# N = 34534 예시

# 1 ~ 9999
for i in range(l - 1):
    for j in range(1, 10):
        answer[j] += 10 ** i

    for j in range(10):
        answer[j] += int(9 * (10 ** (i - 1)) * i)

# 10000 ~ 34534
# 10000 ~ 29999 + 30000 ~ 34534

# 10000 ~ 29999
for i in range(1, int(N[0])):
    answer[i] += 10 ** (l - 1)

for i in range(10):
    answer[i] += int((int(N[0]) - 1) * 10 ** (l - 2) * (l - 1))

# 30000 ~ 34534
# 3이 4535번 + 0000 ~ 4534

# 3이 4535번
answer[int(N[0])] += (num - int(N[0]) * 10 ** (l - 1) + 1)

# 0000 ~ 4534
# 0000 ~ 3999 + 4000 ~ 4534
for j in range(1, l):
    # 0000 ~ 3999
    for i in range(int(N[j])):
        answer[i] += 10 ** (l - (j + 1))
    for i in range(10):
        answer[i] += int(int(N[j]) * 10 ** (l - (j + 2)) * (l - (j + 1)))

    # 4000 ~ 4534
    # 4가 535번 + 000 ~ 534
    # 4가 535번
    answer[int(N[j])] += 1
    if j < l - 1:
        answer[int(N[j])] += int(str(num)[j + 1:])

    # 000 ~ 534 는 다음 for 문에서 -> 이게 계속 반복됨

print(*answer)


'''
0~9 -> 1번씩

10의 자리 올라갈때마다 :

24

-> 1 ~ 9 1번씩
-> 1 * 10 + 0 ~ 9 한번씩
-> 2 * 4 + 0 ~ 4 한번씩

243

1 ~ 9
1~9 1번씩
-> 1~9 10 ** i 번씩

10 ~ 99
1 ~ 9 10번씩, 0 ~ 9 9번씩
-> 1 ~ 9 10 ** i 번씩, 0 ~ 9 9 * 10 ** (i-1) 번씩

100 ~ 999
1 ~ 9 100번씩, 0 ~ 9 90번씩 0 ~ 9 90번씩
-> 1 ~ 9 10 ** i 번씩, 0 ~ 9 9 * 10 ** (i-1) * i 번씩

1000 ~ 9999
1 ~ 9 1000번씩, 0 ~ 9 900번씩, 0 ~ 9 900번씩, 0 ~ 9 900번씩

1000 ~ 4372

1000 ~ 3999
1 ~ 3 1000번씩, 0 ~ 9 300번씩, 0 ~ 9 300번씩, 0 ~ 9 300번씩

4000 ~ 4372
4 373번씩, 000 ~ 372

000 ~ 372

000 ~ 299
0 ~ 2 100번씩, 0 ~ 9 300번씩, 0 ~ 9 300번씩

300 ~ 372
3 * 73번씩, 00 ~ 72


1 ~ 3 1000번씩, 4 373번씩
0 ~ 9 300번씩, 0 ~ 2
'''
